/***************************************************************************
*|
*|	概要　　リザルトレイヤー
*|　作成者　GS2 16 中田湧介
*|　作成日　2017/4/20
*|___________________________________________________________________________
****************************************************************************/
/* ---- ライブラリのインクルード ---------- */
#include "CharacterLayer.h"

USING_NS_CC;

bool CharacterLayer::init()
{
	if (!Layer::init()) {

		return false;

	}

	//レイヤーにノードを集約
	Character* character = Character::create();
	this->addChild(character);

	//毎フレーム呼び出す
	this->scheduleUpdate();

	return true;
}

/***************************************************************************
*|	概要　	タッチされたら
*|	引数　　無し
*|　戻り値　無し
****************************************************************************/
bool CharacterLayer::onTouchBegan(cocos2d::Touch * touch, cocos2d::Event * pEvent)
{
	return true;
}

/***************************************************************************
*|	概要　	スコアのアクション関数を呼びだす　
*|	引数　　無し
*|　戻り値　無し
****************************************************************************/
void CharacterLayer::update(float date)
{

}