/***************************************************************************
*|
*|	概要　　ノームクラスを宣言る
*|　作成者　GS2 16 中田湧介
*|　作成日　2017/6/1
*|___________________________________________________________________________
****************************************************************************/

/* ---- 多重インクルードの防止 ---------- */
#pragma once

/* ----  インクルード ---------- */
#include "cocos2d.h"
#include "Character.h"

class Gnome : public Character
{
public:
	bool init();
	CREATE_FUNC(Gnome);


	void Animation();
private:
	const float SCORECORRECTION = 1.2f;

};
