/***************************************************************************
*|
*|	概要　　敵クラスの宣言
*|　作成者　GS2 16 中田湧介
*|　作成日　2017/5/17
*|___________________________________________________________________________
****************************************************************************/
/* ---- 多重インクルードの防止 ---------- */
#pragma once
/* ----  インクルード ---------- */
#include "cocos2d.h"
#include ".../../GameManager.h"
#include "EnemySprite.h"

class Enemy :public cocos2d::Node
{
public:
	virtual bool init();

	CREATE_FUNC(Enemy);
	EnemySprite* m_enemy;
private:

};