//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//
//　ファイル名：RabbitMold.h
//
//	概　　　要：兎型の金型
//
//　作　成　者：GS2 24 山本悠雅
//
//　作　成　日：2017/05/02
//
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
#pragma once
//ライブラリのインクルード/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
#include "Mold.h"

class RabbitMold : public Mold {
public:
	bool init();

	CREATE_FUNC(RabbitMold);


	//毎フレーム呼び出される関数
	//void update(float delta)override;

private:
	
};