/***************************************************************************
*|
*|	概要　　スコアクラスの宣言
*|　作成者　GS2 16 中田湧介
*|　作成日　2017/4/20
*|___________________________________________________________________________
****************************************************************************/
#pragma once
/* ---- ライブラリのインクルード ---------- */
#include "cocos2d.h"

class Distance :public cocos2d::Node
{
public:
	virtual bool init();

	CREATE_FUNC(Distance);

private:
	//数字スプライト
	cocos2d::Sprite* s_Number[];

};

